# Модуль фитнес-трекера.

## Описание
Программный модуль для обработки данных фитнес-трекера, который расчитывает и отображает
полную информации о тренировках по данным от блока датчиков.

## Функциональность
Модуль выполняет следующие функции:
- принимает от блока датчиков информацию о прошедшей тренировке
- определяет вид тренировки
- рассчитывает результаты тренировки
- выводит информационное сообщение о результатах тренировки

## Входные данные
Блок датчиков фитнес-трекера передаёт пакеты данных в виде кортежа, **первый** элемент которого —
кодовое обозначение прошедшей тренировки, **второй** — список показателей полученных от датчиков устройства.

### Последовательность данных в принимаемых пакетах:
**Плавание**
- Код тренировки: `SWM`.
- Элементы списка: количество гребков, время в часах, вес пользователя, длина бассейна, сколько раз пользователь переплыл бассейн.

**Бег**
- Код тренировки: `RUN`.
- Элементы списка: количество шагов, время тренировки в часах, вес пользователя.

**Спортивная ходьба**
- Код тренировки: `WLK`.
- Элементы списка: количество шагов, время тренировки в часах, вес пользователя, рост пользователя.

*Пример входных данных*
```python
packages = [
     ('SWM', [720, 1, 80, 25, 40]),
     ('RUN', [15000, 1, 75]),
     ('WLK', [9000, 1, 75, 180]),
 ] 
```

## Базовый класс
```python
class Training
```
**Свойства класса**

* action - основное считываемое действие во время тренировке (шаг - бег, ходьба; гребок - плавание);
* duration - длительность тренировки;
* weight - вес спортсмена;
* M_IN_KM = 1000 - константа для перевода значений из метров в километры. Её значение — 1000.
* LEN_STEP - расстояние, которое спортсмен преодолевает за один шаг или гребок. Один шаг — это  `0.65` метра, один гребок
при плавании — `1.38` метра.

**Методы класса**

* get_distance() - метод возвращает значение дистанции приодоленной за тренировку
```python
# базовая формула расчета
шаг * LEN_STEP / M_IN_KM
```
* get_mean_speed() - метод возвращает значение средней скорости движения во время тренировки
* get_spent_calories() - метод возвращает число потраченных калорий
* show_training_info() - метод возвращает объект возвращает объект класса сообщения

## Классы наследники
### Класс беговой тренировки
```python
class Running
```
**Свойства класса**
наследуются

**Методы класса**
Переопределен метод:
`get_spent_calories()` - метод возвращает число потраченных калорий
```python
# формула расчета
(18 * средняя_скорость - 20) * вес_спортсмена / M_IN_KM * время_тренировки_в_минутах
```

### Класс спортивной ходьбы
```python
class SportsWalking
```
**Свойства класса**
Добавлено свойство *height* (рост)

**Методы класса**
Переопределен метод:
`get_spent_calories()` - метод возвращает число потраченных калорий
```python
# формула расчета
(0.035 * вес + (скорость ** 2 // рост) * 0.029 * вес) * время_тренировки_в_минутах
```

### Класс тренировки в бассейне
```python
class Swimming
```
**Свойства класса**
Добавлены свойства:
* *length_pool* - длина бассейна
* *count_pool* - количество проплытых бассейнов

**Методы класса**
Переопределены методы:
`get_mean_speed()` - метод возвращает значение средней скорости движения во время тренировки
```python
# формула расчета
длина_бассейна * count_pool / M_IN_KM / время_тренеровки
```
`get_spent_calories()` - метод возвращает число потраченных калорий
```python
# формула расчета
(скорость + 1.1) * 2 * вес
```
## Класс информационного сообщения
```python
class InfoMessage
```
**Свойства класса**
* training_type - тип тренировки
* duration - длительность тренировки
* distance -дистанция преодоленная за тренировку
* speed - средняя скорость движения во время движения
* calories - потраченные за время тренировки килокалории


**Методы класса**
`get_message()` - метод возвращает строку сообщения:
```python
# выводимое сообщение
# все значения типа float округляются до 3 знаков после запятой
'Тип тренировки: {training_type}; Длительность: {duration} ч.; Дистанция: {distance} км; Ср. скорость: {speed} км/ч; Потрачено ккал: {calories}'.
```

## Функции модуля
```python
def read_package()
```
* Функция read_package() принимает на вход код тренировки и список её параметров.
* Функция определяет тип тренировки и создает объект соответствующего класса,
передав ему на вход параметры, полученные во втором аргументе.

```python
def main(training)
```
Функция `main()` принимает на вход экземпляр класса `Training`.
- При выполнении функции `main()`для этого экземпляра вызывается метод `show_training_info()`;
результатом выполнения метода должен быть объект класса `InfoMessage`, его нужно сохранить в переменную `info`.
- Для объекта `InfoMessage`, сохранённого в переменной `info`, должен быть вызван метод,
который вернет строку сообщения с данными о тренировке; эту строку нужно передать в функцию `print()`.